dev/vllm/benchmarks/phase1-aggressive/20260225-054834/rate-1.5.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f0dbe2d0220>, seed=0, num_prompts=300, dataset_name='sharegpt', no_stream=False, dataset_path='/models/benchmarks/conversations-sharegpt-20260224-205203.json', no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/models/nvidia/Llama-3.1-70B-Instruct-FP8', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.5, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/models/benchmarks/phase1-aggressive/20260225-054834', result_filename='rate-1.5.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='bench-874936b6-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 1.5
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 300/300 [03:45<00:00,  1.33it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     300       
Failed requests:                         0         
Request rate configured (RPS):           1.50      
Benchmark duration (s):                  225.38    
Total input tokens:                      1741762   
Total generated tokens:                  155973    
Request throughput (req/s):              1.33      
Output token throughput (tok/s):         692.05    
Peak output token throughput (tok/s):    1051.00   
Peak concurrent requests:                40.00     
Total token throughput (tok/s):          8420.28   
---------------Time to First Token----------------
Mean TTFT (ms):                          187.50    
Median TTFT (ms):                        114.24    
P50 TTFT (ms):                           114.24    
P95 TTFT (ms):                           526.77    
P99 TTFT (ms):                           680.70    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          38.60     
Median TPOT (ms):                        39.46     
P50 TPOT (ms):                           39.46     
P95 TPOT (ms):                           42.21     
P99 TPOT (ms):                           43.02     
---------------Inter-token Latency----------------
Mean ITL (ms):                           38.55     
Median ITL (ms):                         35.80     
P50 ITL (ms):                            35.80     
P95 ITL (ms):                            38.08     
P99 ITL (ms):                            175.00    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          20189.49  
Median E2EL (ms):                        20409.21  
P50 E2EL (ms):                           20409.21  
P95 E2EL (ms):                           41749.19  
P99 E2EL (ms):                           42533.73  
==================================================